(function() {

// 基于准备好的dom，初始化echarts实例
var myChart = echarts.init(document.getElementById('likes_per_vid'));

var colorMapping = {
    "黑龙江": "#5b8ff9",
    "吉林": "#5b8ff9",
    "辽宁": "#5b8ff9",

    "北京": "#5ad8a6",
    "天津": "#5ad8a6",
    "河北": "#5ad8a6",
    "山西": "#5ad8a6",
    "内蒙古": "#5ad8a6",

    "河南": "#f6bd16",
    "湖南": "#f6bd16",
    "湖北": "#f6bd16",

    "山东": "#e86452",
    "江苏": "#e86452",
    "安徽": "#e86452",
    "上海": "#e86452",
    "浙江": "#e86452",
    "江西": "#e86452",
    "福建": "#e86452",
    "中国台湾": "#e86452",

    "广东": "#6dc8ec",
    "广西": "#6dc8ec",
    "海南": "#6dc8ec",
    "中国香港": "#6dc8ec",
    "中国澳门": "#6dc8ec",

    "陕西": "#ff9845",
    "甘肃": "#ff9845",
    "宁夏": "#ff9845",
    "青海": "#ff9845",
    "新疆": "#ff9845",

    "四川": "#1e9493",
    "贵州": "#1e9493",
    "云南": "#1e9493",
    "重庆": "#1e9493",
    "西藏": "#1e9493",
};

var data = [
    {
        "省份": "四川",
        "平均每条获赞": "9267.54386"
    },
    {
        "省份": "山东",
        "平均每条获赞": "8717.582418"
    },
    {
        "省份": "广西",
        "平均每条获赞": "7461.325967"
    },
    {
        "省份": "广东",
        "平均每条获赞": "7326.732673"
    },
    {
        "省份": "重庆",
        "平均每条获赞": "7187.5"
    },
    {
        "省份": "宁夏",
        "平均每条获赞": "6835.278859"
    },
    {
        "省份": "海南",
        "平均每条获赞": "6079.207921"
    },
    {
        "省份": "贵州",
        "平均每条获赞": "5860.119048"
    },
    {
        "省份": "陕西",
        "平均每条获赞": "4298.746518"
    },
    {
        "省份": "吉林",
        "平均每条获赞": "4228.912241"
    },
    {
        "省份": "江苏",
        "平均每条获赞": "4114.130435"
    },
    {
        "省份": "青海",
        "平均每条获赞": "4110.894942"
    },
    {
        "省份": "山西",
        "平均每条获赞": "3807.040417"
    },
    {
        "省份": "福建",
        "平均每条获赞": "3343.299519"
    },
    {
        "省份": "西藏",
        "平均每条获赞": "2965.517241"
    },
    {
        "省份": "河北",
        "平均每条获赞": "2726.080247"
    },
    {
        "省份": "安徽",
        "平均每条获赞": "2678.988327"
    },
    {
        "省份": "江西",
        "平均每条获赞": "2485.813838"
    },
    {
        "省份": "湖北",
        "平均每条获赞": "2372.492837"
    },
    {
        "省份": "云南",
        "平均每条获赞": "2296.747967"
    },
    {
        "省份": "黑龙江",
        "平均每条获赞": "1936.55303"
    },
    {
        "省份": "湖南",
        "平均每条获赞": "1636.503067"
    },
    {
        "省份": "辽宁",
        "平均每条获赞": "1613.333333"
    },
    {
        "省份": "浙江",
        "平均每条获赞": "1497.764531"
    },
    {
        "省份": "新疆",
        "平均每条获赞": "1288.07947"
    },
    {
        "省份": "上海",
        "平均每条获赞": "1077.06422"
    },
    {
        "省份": "北京",
        "平均每条获赞": "882.0078227"
    },
    {
        "省份": "河南",
        "平均每条获赞": "620.7272727"
    },
    {
        "省份": "内蒙古",
        "平均每条获赞": "359.0342679"
    },
    {
        "省份": "天津",
        "平均每条获赞": "343.4684685"
    },
    {
        "省份": "甘肃",
        "平均每条获赞": "39.83618764"
    }
];

// 指定图表的配置项和数据
    var option = {
        textStyle: {
            color: '#ffffff' // 设置全局默认文字颜色为白色
        },
        tooltip: {},
        xAxis: {
            data: data.map(item => item.省份),
            axisLabel: {
                interval: 0, // 强制显示所有标签
                rotate: 45 // 标签旋转45度
                // 可以根据需要调整旋转角度，以便标签不重叠且易于阅读
            }
        },
        yAxis: {},
        series: [{
            name: '获赞数',
            type: 'bar',
            data: data.map(item => ({
                value: item.平均每条获赞,
                itemStyle: {
                    color: colorMapping[item.省份] || '#c23531' // default color if not found in colorMapping
                }
            }))
        }]
    };



// 使用刚指定的配置项和数据显示图表。
myChart.setOption(option);

// 使图表响应式
window.onresize = function() {
    myChart.resize();
};

    var sharedVariable = 'Value from module5';
// ...
})();